In [1]:
import pandas as rs

In [2]:
data=rs.read_csv("https://raw.githubusercontent.com/AP-State-Skill-Development-Corporation/Datasets/master/Data%20Analysis/Advertising.csv")
data

     Unnamed: 0     TV  radio  newspaper  sales
0             1  230.1   37.8       69.2   22.1
1             2   44.5   39.3       45.1   10.4
2             3   17.2   45.9       69.3    9.3
3             4  151.5   41.3       58.5   18.5
4             5  180.8   10.8       58.4   12.9
..          ...    ...    ...        ...    ...
195         196   38.2    3.7       13.8    7.6
196         197   94.2    4.9        8.1    9.7
197         198  177.0    9.3        6.4   12.8
198         199  283.6   42.0       66.2   25.5
199         200  232.1    8.6        8.7   13.4

[200 rows x 5 columns]

In [3]:
data.shape

(200, 5)

In [4]:
data.describe()

       Unnamed: 0          TV       radio   newspaper       sales
count  200.000000  200.000000  200.000000  200.000000  200.000000
mean   100.500000  147.042500   23.264000   30.554000   14.022500
std     57.879185   85.854236   14.846809   21.778621    5.217457
min      1.000000    0.700000    0.000000    0.300000    1.600000
25%     50.750000   74.375000    9.975000   12.750000   10.375000
50%    100.500000  149.750000   22.900000   25.750000   12.900000
75%    150.250000  218.825000   36.525000   45.100000   17.400000
max    200.000000  296.400000   49.600000  114.000000   27.000000

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
Unnamed: 0    200 non-null int64
TV            200 non-null float64
radio         200 non-null float64
newspaper     200 non-null float64
sales         200 non-null float64
dtypes: float64(4), int64(1)
memory usage: 7.9 KB

In [6]:
data.isna()

     Unnamed: 0     TV  radio  newspaper  sales
0         False  False  False      False  False
1         False  False  False      False  False
2         False  False  False      False  False
3         False  False  False      False  False
4         False  False  False      False  False
..          ...    ...    ...        ...    ...
195       False  False  False      False  False
196       False  False  False      False  False
197       False  False  False      False  False
198       False  False  False      False  False
199       False  False  False      False  False

[200 rows x 5 columns]

In [7]:
data.isna().sum()

Unnamed: 0    0
TV            0
radio         0
newspaper     0
sales         0
dtype: int64

In [8]:
data.isnull().sum()

Unnamed: 0    0
TV            0
radio         0
newspaper     0
sales         0
dtype: int64

In [9]:
data.isna().sum().sum()

0

In [10]:
data.head(3)

   Unnamed: 0     TV  radio  newspaper  sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3

In [11]:
data.iloc[0,3]

69.2

In [12]:
data.loc[0][3]

69.2

In [13]:
data.loc[0]

Unnamed: 0      1.0
TV            230.1
radio          37.8
newspaper      69.2
sales          22.1
Name: 0, dtype: float64

In [14]:
data.loc[0,'newspaper']

69.2

In [15]:
tab_data=rs.read_table("https://raw.githubusercontent.com/AP-State-Skill-Development-Corporation/Datasets/master/Data%20Analysis/chipotle.tsv.txt")
tab_data.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39

In [16]:
tab_data.shape

(4622, 5)

In [17]:
tab_data.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [18]:
tab_data.isnull().sum()

order_id                 0
quantity                 0
item_name                0
choice_description    1246
item_price               0
dtype: int64

In [19]:
tab_data.drop('choice_description',axis=1,inplace=True)
tab_data

      order_id  quantity                              item_name item_price
0            1         1           Chips and Fresh Tomato Salsa     $2.39
1            1         1                                   Izze     $3.39
2            1         1                       Nantucket Nectar     $3.39
3            1         1  Chips and Tomatillo-Green Chili Salsa     $2.39
4            2         2                           Chicken Bowl    $16.98
...        ...       ...                                    ...        ...
4617      1833         1                          Steak Burrito    $11.75
4618      1833         1                          Steak Burrito    $11.75
4619      1834         1                     Chicken Salad Bowl    $11.25
4620      1834         1                     Chicken Salad Bowl     $8.75
4621      1834         1                     Chicken Salad Bowl     $8.75

[4622 rows x 4 columns]

In [20]:
tab_data.drop('quantity',axis=1)

      order_id                              item_name item_price
0            1           Chips and Fresh Tomato Salsa     $2.39
1            1                                   Izze     $3.39
2            1                       Nantucket Nectar     $3.39
3            1  Chips and Tomatillo-Green Chili Salsa     $2.39
4            2                           Chicken Bowl    $16.98
...        ...                                    ...        ...
4617      1833                          Steak Burrito    $11.75
4618      1833                          Steak Burrito    $11.75
4619      1834                     Chicken Salad Bowl    $11.25
4620      1834                     Chicken Salad Bowl     $8.75
4621      1834                     Chicken Salad Bowl     $8.75

[4622 rows x 3 columns]

In [21]:
tab_data

      order_id  quantity                              item_name item_price
0            1         1           Chips and Fresh Tomato Salsa     $2.39
1            1         1                                   Izze     $3.39
2            1         1                       Nantucket Nectar     $3.39
3            1         1  Chips and Tomatillo-Green Chili Salsa     $2.39
4            2         2                           Chicken Bowl    $16.98
...        ...       ...                                    ...        ...
4617      1833         1                          Steak Burrito    $11.75
4618      1833         1                          Steak Burrito    $11.75
4619      1834         1                     Chicken Salad Bowl    $11.25
4620      1834         1                     Chicken Salad Bowl     $8.75
4621      1834         1                     Chicken Salad Bowl     $8.75

[4622 rows x 4 columns]

In [22]:
tab_data.set_index('item_name')

                                       order_id  quantity item_price
item_name
Chips and Fresh Tomato Salsa                  1         1     $2.39
Izze                                          1         1     $3.39
Nantucket Nectar                              1         1     $3.39
Chips and Tomatillo-Green Chili Salsa         1         1     $2.39
Chicken Bowl                                  2         2    $16.98
...                                         ...       ...        ...
Steak Burrito                              1833         1    $11.75
Steak Burrito                              1833         1    $11.75
Chicken Salad Bowl                         1834         1    $11.25
Chicken Salad Bowl                         1834         1     $8.75
Chicken Salad Bowl                         1834         1     $8.75

[4622 rows x 3 columns]

In [23]:
tab_data

      order_id  quantity                              item_name item_price
0            1         1           Chips and Fresh Tomato Salsa     $2.39
1            1         1                                   Izze     $3.39
2            1         1                       Nantucket Nectar     $3.39
3            1         1  Chips and Tomatillo-Green Chili Salsa     $2.39
4            2         2                           Chicken Bowl    $16.98
...        ...       ...                                    ...        ...
4617      1833         1                          Steak Burrito    $11.75
4618      1833         1                          Steak Burrito    $11.75
4619      1834         1                     Chicken Salad Bowl    $11.25
4620      1834         1                     Chicken Salad Bowl     $8.75
4621      1834         1                     Chicken Salad Bowl     $8.75

[4622 rows x 4 columns]

In [24]:
tab_data.set_index('item_name',inplace=True)

In [25]:
tab_data

                                       order_id  quantity item_price
item_name
Chips and Fresh Tomato Salsa                  1         1     $2.39
Izze                                          1         1     $3.39
Nantucket Nectar                              1         1     $3.39
Chips and Tomatillo-Green Chili Salsa         1         1     $2.39
Chicken Bowl                                  2         2    $16.98
...                                         ...       ...        ...
Steak Burrito                              1833         1    $11.75
Steak Burrito                              1833         1    $11.75
Chicken Salad Bowl                         1834         1    $11.25
Chicken Salad Bowl                         1834         1     $8.75
Chicken Salad Bowl                         1834         1     $8.75

[4622 rows x 3 columns]

In [26]:
dia_data=rs.read_csv("https://raw.githubusercontent.com/AP-State-Skill-Development-Corporation/Datasets/master/Classification/diabetes.csv")
dia_data.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1

In [27]:
dia_data.Outcome.unique()

array([1, 0], dtype=int64)

In [28]:
dia_data.Outcome.unique().sum()

1

In [29]:
dia_data['Outcome']==1

0       True
1      False
2       True
3      False
4       True
       ...
763    False
764    False
765    False
766     True
767    False
Name: Outcome, Length: 768, dtype: bool

In [30]:
dia_data[dia_data['Outcome']==1].count()

Pregnancies                 268
Glucose                     268
BloodPressure               268
SkinThickness               268
Insulin                     268
BMI                         268
DiabetesPedigreeFunction    268
Age                         268
Outcome                     268
dtype: int64

In [31]:
dia_data[dia_data['Outcome']==0].count()

Pregnancies                 500
Glucose                     500
BloodPressure               500
SkinThickness               500
Insulin                     500
BMI                         500
DiabetesPedigreeFunction    500
Age                         500
Outcome                     500
dtype: int64

In [32]:
tab_data2=rs.read_table('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/chipotle.tsv')
tab_data2.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [33]:
movie_data=rs.read_table('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/u.user')
movie_data.head(10)

      1|24|M|technician|85711
0          2|53|F|other|94043
1         3|23|M|writer|32067
2     4|24|M|technician|43537
3          5|33|F|other|15213
4      6|42|M|executive|98101
5  7|57|M|administrator|91344
6  8|36|M|administrator|05201
7        9|29|M|student|01002
8        10|53|M|lawyer|90703
9         11|39|F|other|30329

In [34]:
movie_data=rs.read_table('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/u.user',sep='|')
movie_data.head(10)

    1  24  M     technician  85711
0   2  53  F          other  94043
1   3  23  M         writer  32067
2   4  24  M     technician  43537
3   5  33  F          other  15213
4   6  42  M      executive  98101
5   7  57  M  administrator  91344
6   8  36  M  administrator  05201
7   9  29  M        student  01002
8  10  53  M         lawyer  90703
9  11  39  F          other  30329

In [35]:
movie_data=rs.read_table('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/u.user',sep='|',header=None)
movie_data.head(10)

    0   1  2              3      4
0   1  24  M     technician  85711
1   2  53  F          other  94043
2   3  23  M         writer  32067
3   4  24  M     technician  43537
4   5  33  F          other  15213
5   6  42  M      executive  98101
6   7  57  M  administrator  91344
7   8  36  M  administrator  05201
8   9  29  M        student  01002
9  10  53  M         lawyer  90703

In [36]:
col=['Serial No','Age','Gender','DEsignation'.'Empid_stdid']
movie_data=rs.read_table('https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/u.user',sep='|',header=None,column=col)
movie_data.head(10)

SyntaxError: invalid syntax (<ipython-input-36-993389e7a0ae>, line 1)

In [ ]:
movie_data[3].unique()

In [ ]:
movie_data[movie_data[3]=='studnet'].count()

In [ ]:
movie_data[movie_data[3]=='entertainment'].count()

In [ ]:
titanic_data=rs.read_csv('https://raw.githubusercontent.com/AP-State-Skill-Development-Corporation/Datasets/master/Classification/titanic.csv')

In [ ]:
titanic_data

In [ ]:
titanic_data.info()

In [ ]:
titanic_data.isna().sum()

In [ ]:
titanic_data['age'].unique()

In [ ]:
titanic_data['age'].fillna(titanic_data['age'].mean())

In [ ]:
titanic_data['age'].mean()

In [ ]:
titanic_data['age'].isna().sum()

In [ ]:
titanic_data['age'].fillna(titanic_data['age'].mean(),inplace=True)

In [ ]:
titanic_data

In [ ]:
titanic_data['age'].isna().sum()

In [ ]:
titanic_data.drop('cabin',axis=1,inplace=True)

In [ ]:
titanic_data

In [ ]:
titanic_data[titanic_data['embarked']=='S'].count()

In [ ]:
titanic_data[titanic_data['embarked']=='Q'].count()

In [ ]:
titanic_data[titanic_data['embarked']=='C'].count()

In [ ]:
titanic_data['embarked'].isnull().sum()

In [ ]:
titanic_data['embarked'].fillna('S',inplace=True)

In [ ]:
titanic_data['embarked'].isnull().sum().sum()

In [ ]:
rs.get_dummies(titanic_data['sex'])

In [ ]:
titanic_data.sex

In [ ]:
from sklearn.preprocessing import LabelEncoder
lab=LabelEncoder()

In [ ]:
lab.fit_transform(titanic_data['sex'])

In [ ]:
titanic_data['sex']=lab.fit_transform(titanic_data['sex'])

In [ ]:
titanic_data

In [ ]:
titanic_data.info()

In [ ]:
titanic_data['embarked']=lab.fit_transform(titanic_data['embarked'])

In [ ]:
titanic_data.info()

In [ ]:
t1={'Students':['Ram','Ranga','Mounika','Madevi','Madevi'],
        'Sports':['Circket','Basketball','Tennis','Badmition','Badmition'],
       'Subject':['Python','VLSI','Networks','Computers','Computers']}
data1=rs.DataFrame(t1)

In [ ]:
data1

In [ ]:
data1.duplicated()

In [ ]:
data1[data1.duplicated()]

# dataframe.drop_duplicates()

In [ ]:
data1.drop_duplicates()

In [ ]:
data1

In [ ]:
data1.drop_duplicates(inplace=True)

In [ ]:
data1

In [ ]:
import matplotlib.pyplot as plt
list1 =[1,1.2,1.3,2,2.1,2.2,6,7]
list2=[0,0.7,0.5,1.6,2,2.6,2,9]
plt.scatter(list1,list2)

# scaling models
.   MinMax Scaler:
             Xi-min(x)
              ---------
             max(x)-min(x)

In [ ]:
data1=rs.read_csv('https://raw.githubusercontent.com/nagamounika5/Datasets/master/Advertisement.csv')

In [ ]:
data1

In [40]:
data1.drop('Unnamed: 0',axis=1,inplace=True)

NameError: name 'data1' is not defined

In [ ]:
data1

In [ ]:
print(data1['TV'].min())
print(data1['TV'].max())

In [ ]:
(230.1-0.7)/(296.4-0.7)

In [ ]:
from sklearn.preprocessing import MinMaxScaler

In [ ]:
m=MinMaxScaler()

In [ ]:
m

In [ ]:
m3=m.fit_transform(data1)

In [ ]:
m3

In [ ]:
m2=rs.DataFrame(m2)

In [ ]:
m2

In [ ]:
m3=rs.DataFrame(m3,columns =data1.columns)

In [ ]:
m3

In [ ]:
import seaborn as sns

In [ ]:
fig, (axis1,axis2)=plt.subplots(ncols=2,figsize=(9,5))

In [ ]:
fig, (ax1,ax2)=plt.subplots(ncols=2,figsize=(9,5))
sns.kdeplot(data1['TV'],ax=ax1)
sns.kdeplot(data1['radio'],ax=ax1)
sns.kdeplot(data1['newspaper'],ax=ax1)
sns.kdeplot(data1['sales'],ax=ax1)

sns.kdeplot(m3['TV'],ax=ax2)
sns.kdeplot(m3['radio'],ax=ax2)
sns.kdeplot(m3['newspaper'],ax=ax2)
sns.kdeplot(m3['sales'],ax=ax2)

In [39]:
data

     Unnamed: 0     TV  radio  newspaper  sales
0             1  230.1   37.8       69.2   22.1
1             2   44.5   39.3       45.1   10.4
2             3   17.2   45.9       69.3    9.3
3             4  151.5   41.3       58.5   18.5
4             5  180.8   10.8       58.4   12.9
..          ...    ...    ...        ...    ...
195         196   38.2    3.7       13.8    7.6
196         197   94.2    4.9        8.1    9.7
197         198  177.0    9.3        6.4   12.8
198         199  283.6   42.0       66.2   25.5
199         200  232.1    8.6        8.7   13.4

[200 rows x 5 columns]